/*
   Localizable.strings - English
   modizer

   Organized by screens and feature families
*/

// ==================================
// MARK: - COMMON / GENERAL
// ==================================

/* Common Actions */
"Yes" = "Ja";
"No" = "Nei";
"Ok" = "Ok";
"Cancel" = "Avbryt";
"Close" = "Lukk";
"Save" = "Lagre";
"Delete" = "Slett";
"Rename" = "Gi nytt navn";
"Extract" = "Pakk ut";
"Cut" = "Klipp ut";
"Paste" = "Lim inn";
"Create" = "Opprett";
"Reset" = "Tilbakestill";

/* Common States */
"Loading" = "Laster";
"Extracting" = "Pakker ut";
"Seeking" = "Søker";
"Seeking %d%%" = "Søker %d%%";
"Refreshing" = "Oppdaterer";
"Browsing" = "Blar";
"Cancelling..." = "Avbryter...";

/* Common Messages */
"Error" = "Feil";
"OK" = "OK";
"Warning" = "Advarsel";
"Do you want to reset to default value:\n" = "Vil du tilbakestille til standardverdi:\n";


// ==================================
// MARK: - BROWSER
// ==================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Lokal blaing";
"Browser_LocalBrowsing_SubKey" = "Bla gjennom, spill av og slett lokale filer.";

"Browser_MODLAND_MainKey" = "MODLAND-samling";
"Browser_MODLAND_SubKey" = "%d nedlastbare filer.";

"Browser_HVSC_MainKey" = "HVSC-samling";
"Browser_HVSC_SubKey" = "%d nedlastbare filer.";

"Browser_Playlists_MainKey" = "Spillelister";
"Browser_Playlists_SubKey" = "Organiser, opprett, slett og lytt.";

"Browser_Favorites_MainKey" = "Favoritter";
"Browser_Favorites_SubKey" = "Lytt til vurderte sanger.";

"Browser_Most_played_MainKey" = "Mest spilt";
"Browser_Most_played_SubKey" = "Lytt til mest spilte sanger.";

"Browser_Web_MainKey" = "Web";
"Browser_Web_SubKey" = "Bla på internett og last ned musikk.";

"Browser_WorldCharts_MainKey" = "Verdenslister";
"Browser_WorldCharts_SubKey" = "Topplister og nedlastingslenker.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Videospillmusikk rips";

"Browser_UserGuide_MainKey" = "Brukerveiledning";
"Browser_UserGuide_SubKey" = "Manual, FAQ, tips.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Hent alle manglende oppføringer";
"GetAllEntries_SubKey" = "Begrenset til 256 første manglende oppføringer.";

"DisplayAll_MainKey" = "List alle sortert etter navn";
"DisplayAll_SubKey" = "Gjeldende mappe:";

"DisplayDir_MainKey" = "Liste/Katalog";
"DisplayDir_SubKey" = "Alle sortert etter sti:";

"DisplayAllPath_MainKey" = "List alle sortert etter sti";
"DisplayAllPath_SubKey" = "Alle sortert etter navn:";

/* Browser View Modes */
"Formats/Artists/Files" = "Formater/Artister/Filer";
"Artists/Formats/Files" = "Artister/Formater/Filer";
"Artists/Files" = "Artister/Filer";
"Formats: %d entries." = "Formater: %d oppføringer.";
"Artists: %d entries." = "Artister: %d oppføringer.";

/* Browser Stats */
"Played %d times." = "Spilt %d ganger.";
"Played once." = "Spilt én gang.";
"Never played." = "Aldri spilt.";
"%d files." = "%d filer.";
"1 file." = "1 fil.";
"Size: %dKB" = "Størrelse: %dKB";

/* Browser Messages */
"Browser not enough mem." = "For mange oppføringer, kan ikke tildele minne.";
"Browser not enough mem. Limited." = "For mange oppføringer, kan ikke tildele minne. Listen er ufullstendig.";

/* File Operations */
"New folder" = "Ny mappe";
"Enter folder name" = "Skriv inn mappenavn";
"Nothing to paste" = "Ingenting å lime inn";
"No file to extract or not supported archive format.\n" = "Ingen fil å pakke ut eller ikke-støttet arkivformat.\n";
"Cannot use iCloud as folder name" = "Kan ikke bruke iCloud som mappenavn";

"Issue %d while trying to delete entry.\n%@" = "Problem %d ved forsøk på å slette oppføring.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Problem %d ved forsøk på å gi filen nytt navn.\n%@";
"Issue %d while moving: %@.\n%@" = "Problem %d ved flytting: %@.\n%@";
"Issue %d while creating folder\n%@" = "Problem %d ved oppretting av mappe\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "Filen er ikke tilgjengelig lokalt.\nStarter nedlasting fra iCloud, vennligst sjekk i 'Filer'-appen.";

"unavailable" = "utilgjengelig";

// ==================================
// MARK: - SEARCH
// ==================================

/* Search States */
"Playlist (%d)" = "Spilleliste (%d)";
"Playlist/Search off" = "Spilleliste/Søk av";

"Local (%d, limited to %d)" = "Lokal (%d, begrenset til %d)";
"Local (%d)" = "Lokal (%d)";
"Local/Search off" = "Lokal/Søk av";

"Modland (%d, limited to %d)" = "Modland (%d, begrenset til %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Søk av";

"HVSC (%d, limited to %d)" = "HVSC (%d, begrenset til %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Søk av";

"ASMA (%d, limited to %d)" = "ASMA (%d, begrenset til %d)";
"ASMA (%d)" = "ASMA (%d)";
"ASMA/Search off" = "ASMA/Søk av";

/* Search Messages */
"Searching Playlists..." = "Søker i spillelister...";
"Searching Local files..." = "Søker i lokale filer...";
"Searching MODLAND..." = "Søker i MODLAND...";
"Searching HVSC..." = "Søker i HVSC...";

"Please enter at least 2 characters for your search." = "Vennligst skriv inn minst 2 tegn for søket ditt.";
"Please activate at least 1 section for your search." = "Vennligst aktiver minst 1 seksjon for søket ditt.";


// ==================================
// MARK: - PLAYER / NOW PLAYING
// ==================================

/* Player States */
"Now playing" = "Spiller nå";
"Now playing(%d)" = "Spiller nå(%d)";
"Most played" = "Mest spilt";
"Favorites" = "Favoritter";
"Resuming last\n played file" = "Gjenopptar sist\n spilte fil";

/* Player Controls */
"Previous" = "Forrige";
"Previous file" = "Forrige fil";
"Next file" = "Neste fil";
"Next" = "Neste";
"Shuffle" = "Stokk";
"Voices control" = "Stemmekontroll";
"All voices" = "Alle stemmer";
"Clear 'Now Playing' queue" = "Tøm 'Spiller nå'-køen";

/* Song Selection */
"Choose a subsong" = "Velg en undersang";
"Choose a song" = "Velg en sang";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Ingenting spiller for øyeblikket. Vennligst velg en fil.";
"File cannot be played. Skipping to next playable file." = "Filen kan ikke spilles. Hopper til neste spillbare fil.";
"Too much entries! Playlist will be limited to %d first entries." = "For mange oppføringer! Spillelisten begrenses til %d første oppføringer.";
"Playlist is full. Delete some entries to add more." = "Spillelisten er full. Slett noen oppføringer for å legge til flere.";

/* Metadata */
"unknown_title" = "Ukjent tittel";
"unknown_album" = "Ukjent album";
"now_playing_format" = "Spiller: %@ fra %@";


// ==================================
// MARK: - PLAYLISTS
// ==================================

/* Playlist Actions */
"New playlist" = "Ny spilleliste";
"Create new playlist" = "Opprett ny spilleliste";
"Save current one" = "Lagre gjeldende";
"Rename playlist" = "Gi spilleliste nytt navn";
"Add to a playlist" = "Legg til i spilleliste";
"Choose a playlist" = "Velg en spilleliste";

/* Playlist Descriptions */
"Create a new empty playlist." = "Opprett en ny tom spilleliste.";
"Create a playlist from currently played files." = "Opprett en spilleliste fra nåværende spilte filer.";
"Browse files" = "Bla gjennom filer";
"Add or remove entries from browser." = "Legg til eller fjern oppføringer fra nettleseren.";
"Choose a new name." = "Velg et nytt navn.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Er du sikker på at du vil slette denne spillelisten?";
"Are you sure you want to delete this entry ?" = "Er du sikker på at du vil slette denne oppføringen?";


// ==================================
// MARK: - DOWNLOADS
// ==================================

"Downloads" = "Nedlastinger";
"Download queue: 1 file" = "Nedlastingskø: 1 fil";
"Download queue: %d files" = "Nedlastingskø: %d filer";
"No download in progress" = "Ingen pågående nedlastinger";
"Downloaded %@" = "Lastet ned %@";
"Downloading %@" = "Laster ned %@";
"Cannot download from this URL." = "Kan ikke laste ned fra denne URL-en.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Kunne ikke legge til filer. Vennligst sjekk manuelt med filutforsker (Lokal blaing/Nedlastinger).";
"File already available locally. Do you want to download it again?" = "Filen er allerede tilgjengelig lokalt. Vil du laste den ned igjen?";
"URL have to start with ftp:// or http://" = "URL må starte med ftp:// eller http://";
"Cannot connect to FTP." = "Kan ikke koble til FTP.";


// ==================================
// MARK: - DATABASE
// ==================================

"Database created." = "Database opprettet.";
"Database will now be recreated. Please validate & wait." = "Databasen vil nå bli gjenskapt. Vennligst bekreft og vent.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Feil databaseversjon: %d.%d. Oppdaterer til %d.%d. Vennligst bekreft og vent.";
"No database found. Will create a new one. Please validate & wait..." = "Ingen database funnet. Oppretter en ny. Vennligst bekreft og vent...";


// ==================================
// MARK: - COVERS / IMAGES
// ==================================

"Image detected" = "Bilde oppdaget";
"Choose_SaveCover" = "Lagre bilde som cover for %@?";
"CoverFolder" = "Som mappecover";
"CoverFile" = "Som filcover";
"Confirm_RemCurCovers" = "Fjern gjeldende covere for %@ (mappe og fil)?";


// ==================================
// MARK: - SETTINGS - GENERAL
// ==================================

/* Settings Sections */
"Settings_General" = "Generelt";
"Settings_Player" = "Avspiller";
"Settings_Display" = "Skjerm";
"Settings_Download" = "Nedlasting";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Avspillingsbiblioteker";
"Settings_Settings" = "Innstillinger";

/* Settings Presets */
"Settings_SettingsDefault" = "Standard";
"Settings_SettingsHigh" = "Høy";
"Settings_SettingsMed" = "Medium";
"Settings_SettingsLow" = "Lav";

"Confirm_SettingsDef" = "Er du sikker på at du vil tilbakestille innstillinger til 'standard'-verdier?";
"Confirm_SettingsHigh" = "Er du sikker på at du vil tilbakestille innstillinger til 'høye' verdier?";
"Confirm_SettingsMed" = "Er du sikker på at du vil tilbakestille innstillinger til 'medium'-verdier?";
"Confirm_SettingsLow" = "Er du sikker på at du vil tilbakestille innstillinger til 'lave' verdier?";

/* Global Player Settings */
"Search: simplified regexp ('.' -> '\\.', '*' -> '.*')" = "Søk: forenklet regexp ('.' -> '\\.', '*' -> '.*')";
"Resume position on launch" = "Gjenoppta posisjon ved oppstart";
"Notification" = "Varsling";
"Notification duration" = "Varslingsvarighet";
"Disable screen auto lock" = "Deaktiver automatisk skjermlås";
"No screen auto lock" = "Ingen automatisk skjermlås";
"Enable playback ratio" = "Aktiver avspillingsforhold";
"Playback ratio" = "Avspillingsforhold";
"Default length" = "Standardlengde";
"Default length %d:%.2d" = "Standardlengde %d:%.2d";
"Fade-out time" = "Fade-out tid";
"Silence Detection" = "Stillhetsdeteksjon";
"Stop song if silent for more than selected number of seconds. 0: off" = "Stopp sang hvis stille i mer enn valgt antall sekunder. 0: av";
"Will skip song if nothing is played for specified duration (0=off)" = "Hopper over sang hvis ingenting spilles i angitt varighet (0=av)";
"Force mono" = "Tving mono";
"Panning" = "Panorering";
"Panning value" = "Panoreringsverdi";
"Audio latency" = "Lydlatens";
"Audio latency in ms" = "Lydlatens i ms";
"Multi default action" = "Multi standardhandling";
"Browse" = "Bla";
"Archive/multi play mode" = "Arkiv/multi avspillingsmodus";
"Entry" = "Oppføring";

/* Archive Settings */
"Archive multi default action" = "Arkiv multi standardhandling";
"Archive multi play mode" = "Arkiv multi avspillingsmodus";

/* Playlist Settings */
"Play/Enqueue action" = "Spill/Legg i kø handling";
"Enqueue mode" = "Legg i kø modus";
"Default Action" = "Standardhandling";
"Play" = "Spill";
"Enqueue" = "Legg i kø";
"Enq.&Play" = "Kø og spill";
"First" = "Først";
"Current" = "Gjeldende";
"Last" = "Sist";
"Enqueue position" = "Køposisjon";
"Post download action" = "Handling etter nedlasting";
"Nothing" = "Ingenting";

/* Display Settings */
"Background mode" = "Bakgrunnsmodus";
"Partial" = "Delvis";
"Full" = "Full";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Av=ingen bakgrunnsprosess, Delvis=fortsett å spille musikk, Full=hold appen på i bakgrunnen";
"Long name truncate" = "Lang navnetrunkering";
"Head" = "Start";
"Mid." = "Midt";
"Tail" = "Slutt";
"Filename as title" = "Filnavn som tittel";

/* Local Files Settings */
"Auto. restore Samples folder" = "Auto. gjenopprett Samples-mappe";
"Send statistics" = "Send statistikk";


// ==================================
// MARK: - SETTINGS - DATABASE
// ==================================

"Settings_DB" = "Database";
"Settings_CleanDB" = "Rens database";
"Settings_ResetPlCnt" = "Tilbakestill avspillingsteller";
"Settings_ResetRatings" = "Tilbakestill vurderinger";
"Settings_ResetDB" = "Tilbakestill hele databasen";

"Confirm_DBClean" = "Start databaserensing (kan ta en stund)?";
"Confirm_Reset_PlCnt" = "Er du sikker på at du vil tilbakestille alle avspillingsteller?";
"Confirm_Reset_Ratings" = "Er du sikker på at du vil tilbakestille alle vurderinger?";
"Confirm_ResetDB" = "Er du sikker på at du vil tilbakestille hele databasen? Spillelister, vurderinger og tellere vil bli slettet.";


// ==================================
// MARK: - SETTINGS - LOCAL FILES
// ==================================

"Settings_LocalFiles" = "Lokale filer";
"Settings_RecreateSamples" = "Gjenopprett 'Samples'-mappe";
"Settings_FormatDownloads" = "Formater 'Nedlastinger'-mappe";
"Settings_RemCovers" = "Fjern covere";
"Settings_UpdateFilesBackupFlag" = "Sjekk filsystem";

"Confirm_RecreateSamples" = "Vil du gjenopprette 'Samples'-mappen.";
"Confirm_FormatDownloads" = "Vil du fjerne ALLE filer fra Lokal blaing/Web-mappe.";
"Confirm_CheckFiles" = "Vil du utføre lokal filsystemsjekk?";


// ==================================
// MARK: - SETTINGS - PLUGINS
// ==================================

/* Adplug */
"OPL type" = "OPL-type";
"Stereo surround" = "Stereo surround";

/* GBSPlay */
"HP filter type" = "HP-filtertype";
"Highpass filter type" = "Høypassfiltertype";

/* Game Music Emu (GME) */
"Stereo separation" = "Stereoseparasjon";
"Ignore silence" = "Ignorer stillhet";
"Silence detection" = "Stillhetsdeteksjon";
"Equalizer" = "Equalizer";
"Bass" = "Bass";
"Treble" = "Diskant";

/* GSF */
"Sound quality" = "Lydkvalitet";
"Interpolation" = "Interpolasjon";
"Low-pass filter" = "Lavpassfilter";
"Echo" = "Ekko";

/* Highly Complete (HC) */
"Resample quality" = "Resample kvalitet";
"Main enabled" = "Hoved aktivert";
"Reverb enabled" = "Reverb aktivert";

/* NSFPlay */
"NSFPLAY default length" = "NSFPLAY standardlengde";
"LPF strength" = "LPF styrke";
"Min=off, default: 112" = "Min=av, standard: 112";
"HPF strength" = "HPF styrke";
"Region" = "Region";
"VRC7 Patches" = "VRC7 patcher";
"Force IRQ" = "Tving IRQ";
"Quality" = "Kvalitet";

/* OpenMPT */
"Master volume" = "Hovedvolum";
"Sampling" = "Sampling";
"Resampling" = "Resampling";

/* SID */
"Engine" = "Motor";
"Filter" = "Filter";
"Force loop" = "Tving loop";
"Clock" = "Klokke";
"Model" = "Modell";
"Force 2nd SID" = "Tving 2. SID";
"Address 2nd" = "Adresse 2.";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF eller 0xDE00-0xDFFF";
"Force 3rd SID" = "Tving 3. SID";
"Address 3rd" = "Adresse 3.";

/* Timidity */
"Max loop" = "Maks loop";
"MIDI polyphony" = "MIDI polyfoni";
"Amplification" = "Forsterkning";
"Chorus" = "Kor";
"Reverb" = "Reverb";
"Resample" = "Resample";
"LP filter" = "LP filter";

/* UADE */
"Headphones" = "Hodetelefoner";
"LED filter" = "LED-filter";
"Normalization" = "Normalisering";
"Post FX" = "Post FX";
"Panning" = "Panorering";
"Panning value" = "Panoreringsverdi";
"Gain" = "Forsterkning";
"Gain value" = "Forsterkningsverdi";
"Force NTSC" = "Tving NTSC";

/* VGMPlay */
"Prefer JTAG" = "Foretrekk JTAG";
"YM2612 emulator" = "YM2612 emulator";
"Nuked OPN2 option" = "Nuked OPN2 valg";
"YMF262 emulator" = "YMF262 emulator";
"YM3812 emulator" = "YM3812 emulator";
"QSound emulator" = "QSound emulator";
"RF5C68 emulator" = "RF5C68 emulator";

/* VGMStream */
"Max loop" = "Maks loop";

/* XMP */
"Amiga 500 Filter" = "Amiga 500 filter";


// ==================================
// MARK: - SETTINGS - VISUALIZATIONS
// ==================================

/* General FX */
"FX Alpha" = "FX Alpha";
"FX Fullscreen" = "FX Fullskjerm";
"FX FPS" = "FX FPS";
"FX show info" = "FX vis info";
"Tech Info" = "Teknisk info";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Vis FPS og annen info (CPU, oppløsning, ProjectM lyddata)";
"FX Level of details" = "FX detaljeringsnivå";
"Low" = "Lav";
"Med" = "Medium";
"High" = "Høy";
"Slow FX limit" = "Langsom FX-grense";
"Deactivate FX if too slow." = "Deaktiver FX hvis for langsom.";
"Weak" = "Svak";
"Strong" = "Sterk";
"Display song info" = "Vis sanginformasjon";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "I fullskjerm, vis sanginformasjon når den endres. TL er øverst til venstre, DR er nederst til høyre, C er senter.";

/* ProjectM */
"ProjectM settings" = "ProjectM-innstillinger";
"ProjectM on/off" = "ProjectM på/av";
"Show preset label" = "Vis forhåndsinnstillingsetikett";
"Auto switch presets mode" = "Auto bytt forhåndsinnstillingsmodus";
"Lock preset" = "Lås forhåndsinnstilling";
"Time between preset" = "Tid mellom forhåndsinnstillinger";
"Blend presets" = "Bland forhåndsinnstillinger";
"Blend time" = "Blandetid";
"Bundled presets" = "Medfølgende forhåndsinnstillinger";
"Custom presets" = "Egendefinerte forhåndsinnstillinger";
"Aspect ratio" = "Sideforhold";
"Mesh size X" = "Mesh-størrelse X";
"Mesh size Y" = "Mesh-størrelse Y";
"Hard cut enabled" = "Hard kutt aktivert";
"Hard cut min time" = "Hard kutt min tid";
"Hard cut sensitivity" = "Hard kutt følsomhet";
"Beat sensitivity" = "Taktfølsomhet";
"Permissive mode" = "Tillatelses modus";

/* Oscilloscope */
"Oscillo settings" = "Oscillo-innstillinger";
"FX mode" = "FX-modus";
"Show label" = "Vis etikett";
"Label font size" = "Etikett skriftstørrelse";
"Show grid" = "Vis rutenett";
"Grid color" = "Rutenettfarge";
"Line width" = "Linjebredde";
"Mono color" = "Monofarge";
"Multi color set" = "Multi fargesett";
"Reset all colors" = "Tilbakestill alle farger";
"Thin" = "Tynn";
"Medium" = "Medium";
"Thick" = "Tykk";
"Beefy" = "Kraftig";

/* Piano Roll / MIDI */
"Piano roll" = "Pianorulle";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Aktiver pianorulle FX, standard eller 'Synthesia'-lignende";
"Activate spark FX, colored or white" = "Aktiver gnist FX, farget eller hvit";
"Display voices labels" = "Vis stemmeetiketter";
"Display octaves labels" = "Vis oktavetiketter";
"MIDI pattern" = "MIDI-mønster";
"MIDI cut line" = "MIDI snittlinje";
"MIDI bar style" = "MIDI stolpestil";
"MIDI bar vibrato" = "MIDI stolpe vibrato";
"Piano 3D" = "Piano 3D";
"Piano cut line" = "Piano snittlinje";
"Piano color mode" = "Piano fargemodus";

/* Spectrum */
"3D spectrum" = "3D spektrum";
"3D spectrum bloom" = "3D spektrum bloom";
"Spectrum" = "Spektrum";
"3D landscape" = "3D landskap";
"3D landscape bloom" = "3D landskap bloom";

/* MOD Pattern */
"MOD pattern" = "MOD-mønster";
"MOD pattern BG alpha" = "MOD-mønster BG alpha";
"MOD pattern vol bar" = "MOD-mønster volumstolpe";
"MOD pattern current line mode" = "MOD-mønster gjeldende linjemode";
"MOD pattern font" = "MOD-mønster skrifttype";
"MOD pattern font size" = "MOD-mønster skriftstørrelse";
"MOD pattern theme" = "MOD-mønster tema";


// ==================================
// MARK: - WEB BROWSER
// ==================================

"Browser_Welcome_Message" = "<b>Velkommen til Modizers nettleser!</b><br><br>Bruk adressefeltet ovenfor til å navigere eller utforsk bokmerkene dine.<br><br>For å bruke et bilde som cover, kopier det til utklippstavlen med et langt trykk (iOS) eller høyreklikk (macOS).";
"Bookmarks" = "Bokmerker";


// ==================================
// MARK: - ABOUT
// ==================================

"About_Text" = "v4.1 • Yohann Magnien / YoyoFR\n\nKontakt: mailto:modizerhelp@gmail.com\nWeb: https://modizer.app\n\nModizers logo av Steve Miele.\n\nAntall støttede filformater/utvidelser: 1090.\n!PM!,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,50A,60A,61A,669,800,9TAV,A2M,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GTD,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,S98xxxxxxxxx,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTH,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nIntegrerte avspillerbiblioteker:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(bruker Merlin_gold SF2 soundfont)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebSID\n- ZXTune\n\nAnsvarsfraskrivelse:\nInternett-tilgang til Modland, HVSC og ASMA-bibliotekene leveres som en as-is-tjeneste, garanti for tilgjengelighet og/eller funksjonalitet er ikke gitt. Bruk denne applikasjonen på egen risiko.";


// ==================================
// MARK: - SUPPORT
// ==================================

"Mail support" = "E-poststøtte";
"Contact support by email" = "Kontakt støtte via e-post";
"[Please describe your request below]" = "[Vennligst beskriv forespørselen din nedenfor]";


// ==================================
// MARK: - DONATION / TIPS
// ==================================

"Thank You! 🙏" = "Takk! 🙏";
"Send a tip to Modizer" = "Send et tips til Modizer";
"Support Modizer development" = "Støtt Modizer-utvikling";


// ==================================
// MARK: - LAUNCH / INITIALIZATION
// ==================================

"Cleaning DB &\n reseting settings" = "Renser DB og\n tilbakestiller innstillinger";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Første oppstart eller problem oppstod sist Modizer kjørte. Bruk standardinnstillinger?";


// ==================================
// MARK: - SIRI / APP INTENTS
// ==================================

/* Intent Titles */
"Play" = "Spill";
"Pause" = "Pause";
"Stop" = "Stopp";
"Next Song" = "Neste sang";
"Previous Song" = "Forrige sang";
"Play Subsong" = "Spill undersang";
"Seek" = "Søk";
"Set Infinite Loop" = "Sett uendelig loop";
"Set Loop Mode" = "Sett loop-modus";
"Set Shuffle Mode" = "Sett stokk-modus";
"Toggle Shuffle" = "Bytt stokk";
"Toggle Loop Mode" = "Bytt loop-modus";
"Set Fullscreen mode" = "Sett fullskjermmodus";
"Go the player view" = "Gå til avspillervisning";
"Set FX" = "Sett FX";
"Get Now Playing" = "Hent nå spiller";
"Get Playlists" = "Hent spillelister";
"Play some music" = "Spill litt musikk";
"Play most played" = "Spill mest spilt";
"Play favorites" = "Spill favoritter";
"Play Playlist" = "Spill spilleliste";
"Play Playlist By Name" = "Spill spilleliste etter navn";

/* Intent Descriptions */
"Starts playing music in Modizer." = "Starter musikkavspilling i Modizer.";
"Pauses music playback in Modizer." = "Pauser musikkavspilling i Modizer.";
"Stops music playback in Modizer." = "Stopper musikkavspilling i Modizer.";
"Skips to the next song in Modizer." = "Hopper til neste sang i Modizer.";
"Skips to the previous song in Modizer." = "Hopper til forrige sang i Modizer.";
"Plays a specific subsong in the current file." = "Spiller en spesifikk undersang i gjeldende fil.";
"Seeks to a specific position in the current song." = "Søker til en spesifikk posisjon i gjeldende sang.";
"Set the infinite loop mode in Modizer." = "Sett uendelig loop-modus i Modizer.";
"Set the loop mode in Modizer." = "Sett loop-modus i Modizer.";
"Set the shuffle mode in Modizer." = "Sett stokk-modus i Modizer.";
"Toggles shuffle mode in Modizer." = "Bytter stokk-modus i Modizer.";
"Toggles loop mode in Modizer." = "Bytter loop-modus i Modizer.";
"Set Fullscreen mode on or off in Modizer." = "Slå fullskjermmodus på eller av i Modizer.";
"Go the player view in Modizer." = "Gå til avspillervisningen i Modizer.";
"Set FX mode in Modizer." = "Sett FX-modus i Modizer.";
"Gets information about the currently playing song." = "Henter informasjon om den nåværende spillende sangen.";
"Gets the list of available playlists in Modizer." = "Henter listen over tilgjengelige spillelister i Modizer.";
"Random picks from available local titles in Modizer." = "Tilfeldige valg fra tilgjengelige lokale titler i Modizer.";
"Most played titles from available local titles in Modizer." = "Mest spilte titler fra tilgjengelige lokale titler i Modizer.";
"Favorites titles from available local titles in Modizer." = "Favoritt-titler fra tilgjengelige lokale titler i Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Spiller en spesifikk spilleliste i Modizer. Merk: For beste resultater med talekommandoer, bruk 'Spill spilleliste etter navn' i stedet.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Spiller en spilleliste etter navn i Modizer. Anbefalt for talekommandoer.";

/* Parameters */
"Subsong Index" = "Undersang-indeks";
"The index of the subsong to play" = "Indeksen til undersangen som skal spilles";
"Position (seconds)" = "Posisjon (sekunder)";
"The position to seek to in seconds" = "Posisjonen å søke til i sekunder";
"Relative" = "Relativ";
"Whether to seek relative to current position" = "Om det skal søkes relativt til gjeldende posisjon";
"Infinite Loop Mode" = "Uendelig loop-modus";
"0: off, 1: infinite loop" = "0: av, 1: uendelig loop";
"Repeat Mode" = "Gjenta-modus";
"0: off, 1: loop current title, 2: loop playlist" = "0: av, 1: loop gjeldende tittel, 2: loop spilleliste";
"Shuffle Mode" = "Stokk-modus";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: av, 1: velg kun én tittel hvis filen har undersanger eller er et arkiv, 2: spill alle titler i en gitt fil";
"Fullscreen mode" = "Fullskjermmodus";
"Activate (1) or disactivate (0) Fullscreen mode" = "Aktiver (1) eller deaktiver (0) fullskjermmodus";
"FX" = "FX";
"The FX to set" = "FX som skal settes";
"FX Mode" = "FX-modus";
"The mode to activate for the selected FX (0:off)" = "Modusen som skal aktiveres for valgt FX (0:av)";
"Playlist" = "Spilleliste";
"The playlist to play" = "Spillelisten som skal spilles";
"Start Index" = "Startindeks";
"The index of the song to start playing from (0-based)" = "Indeksen til sangen som skal starte fra (0-basert)";
"Playlist Name" = "Spillelistenavn";
"The name of the playlist to play" = "Navnet på spillelisten som skal spilles";
"Which playlist would you like to play?" = "Hvilken spilleliste vil du spille?";

/* Dialog Messages */
"play_playlist_dialog" = "Spiller spilleliste %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Spilleliste ikke funnet. Bruk 'Hent spillelister' for å se tilgjengelige spillelister.";
"No playlists found" = "Ingen spillelister funnet";

/* FX Names */
"ProjectM" = "ProjectM";
"Oscillo" = "Oscillo";
"Piano roll" = "Pianorulle";
"3D Piano" = "3D piano";
"Notes bars" = "Notestolper";
"Tracker" = "Tracker";
"2D Spectrum" = "2D spektrum";
"3D Spectrum" = "3D spektrum";
"3D Landscape" = "3D landskap";

// ==================================
// MARK: - TABS
// ==================================

"Search" = "Søk";
"More" = "Mer";
"Suspend" = "Suspender";
"Clear all" = "Tøm alt";
"Online" = "Online";


// ==================================
// MARK: - MORE TAB
// ==================================

"About" = "Om";
"Some general informations" = "Noe generell informasjon";
"Settings" = "Innstillinger";
"Global, Visu, FTP & Plugins" = "Global, Visu, FTP og Plugins";
"Maintenance" = "Vedlikehold";
"Clean DB, Reset ratings, ..." = "Rens DB, tilbakestill vurderinger, ...";


// ==================================
// MARK: - ONLINE TAB / COLLECTIONS
// ==================================

/* Section Headers */
"Collections" = "Samlinger";
"Browse Internet" = "Bla på internett";
"Games Music" = "Spillmusikk";
"Mods & chiptunes" = "Mods og chiptunes";
"Other" = "Annet";

/* Collections */
"MODLAND collection" = "MODLAND-samling";
"HVSC collection" = "HVSC-samling";
"ASMA collection" = "ASMA-samling";
"JOSHW collection" = "JOSHW-samling";
"VGMRips collection" = "VGMRips-samling";
"SNESmusic collection" = "SNESmusic-samling";
"SMS Power! collection" = "SMS Power!-samling";
"ZXArt collection" = "ZXArt-samling";

/* Collection Descriptions */
"%d entries" = "%d oppføringer";
"Thousands of entries" = "Tusenvis av oppføringer";
"2K+ packs / 40K+ songs" = "2K+ pakker / 40K+ sanger";
"1500+ sets / Super Nintendo/Famicom" = "1500+ sett / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Master System og Game gear sett";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Modizer verdenslister";
"Web browser" = "Nettleser";
"No internet connectivity or website down." = "Ingen internettforbindelse eller nettsted nede.";

// ==================================
// MARK: - SETTINGS - FAMILIES & UI
// ==================================

/* Settings Families */
"Global" = "Global";
"Default Players" = "Standard avspillere";
"Visualizers" = "Visualiseringer";
"PR & NS colors settings" = "PR og NS fargeinnstillinger";
"Plugins" = "Plugins";

/* Player Selection */
"MOD player" = "MOD-avspiller";
"SAP player" = "SAP-avspiller";
"SID player" = "SID-avspiller";
"VGM player" = "VGM-avspiller";
"YM player" = "YM-avspiller";
"NSF player" = "NSF-avspiller";
"PT3 player" = "PT3-avspiller";
"GBS player" = "GBS-avspiller";
"KSS player" = "KSS-avspiller";
"2SF player" = "2SF-avspiller";
"MIDI player" = "MIDI-avspiller";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Kun for plugins som støtter denne funksjonen (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, forsinkelse avrundet til et multiplum av lydbufferstørrelse";
"Limited: not for subsong" = "Begrenset: ikke for undersang";
"Default value is 3s" = "Standardverdi er 3s";
"Default action when selecting an archive or a multisong file" = "Standardhandling ved valg av arkiv eller multi-sangfil";
"Play only selected entry or full archive/multisong file" = "Spill kun valgt oppføring eller fullt arkiv/multi-sangfil";
"Show Welcome screen" = "Vis velkomstskjerm";
"Adplug priority for module" = "Adplug prioritet for modul";

/* FTP Settings */
"Server status" = "Serverstatus";
"FTP Server" = "FTP-server";
"Authorize anonymous" = "Autoriser anonym";
"User" = "Bruker";
"Password" = "Passord";
"Port" = "Port";

/* Online Settings */
"MODLAND URL" = "MODLAND URL";
"HVSC URL" = "HVSC URL";
"ASMA URL" = "ASMA URL";
"MODLAND Server" = "MODLAND-server";
"MODLAND cust.URL" = "MODLAND tilpasset URL";
"HVSC Server" = "HVSC-server";
"HVSC cust.URL" = "HVSC tilpasset URL";
"ASMA Server" = "ASMA-server";
"ASMA cust.URL" = "ASMA tilpasset URL";


// ==================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ==================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Mønstre BG Alpha";
"Opacity of mod patterns view" = "Ugjennomsiktighet for mod-mønster visning";
"MOD Color Theme" = "MOD fargetema";
"MOD Current Line" = "MOD gjeldende linje";
"MOD Volume bars" = "MOD volumstolper";
"MOD Pattern Font" = "MOD mønster skrifttype";
"MOD Pattern Font Size" = "MOD mønster skriftstørrelse";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "Pianorulle FX";
"PR/Spark FX" = "PR/Gnist FX";
"Display voices label" = "Vis stemmeetikett";
"Notes scroller FX" = "Noterullings FX";
"NS/bars mode" = "NS/stolpe-modus";
"NS/bars style" = "NS/stolpe-stil";
"Vibrato display" = "Vibrato-visning";
"Piano FX" = "Piano FX";
"Piano bars mode" = "Piano stolpe-modus";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "3D Sp.Bloom";
"3D Land. Bloom" = "3D Land. Bloom";
"0: off" = "0: av";

/* ProjectM Settings */
"ProjectM FX" = "ProjectM FX";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Renderingskvalitet: Maks er pikseloppl., 1/2 er halv, ...";
"Custom presets/textures should be copied in .projectm folder" = "Egendefinerte forhåndsinnstillinger/teksturer bør kopieres til .projectm-mappe";
"Display preset name" = "Vis forhåndsinnstillingsnavn";
"Lim: display and disappear quickly" = "Lim: vis og forsvinne raskt";
"Auto switch presets" = "Auto bytt forhåndsinnstillinger";
"Allow loading of milk file with script issues" = "Tillat lasting av milk-fil med script-problemer";
"Default is 15s" = "Standard er 15s";
"Default is 2.7s" = "Standard er 2.7s";
"Default value is 32" = "Standardverdi er 32";
"Default value is 24" = "Standardverdi er 24";
"Default value is 20" = "Standardverdi er 20";
"Hardcut" = "Hardkutt";
"Hardcut triggers presets switch synchronized with beats." = "Hardkutt utløser forhåndsinnstillingsbytte synkronisert med takter.";
"Hardcut min time" = "Hardkutt min tid";
"Preserve aspect ratio for compatible shaders." = "Behold sideforhold for kompatible shadere.";
"Default value is 1" = "Standardverdi er 1";
"Hardcut sensitivity" = "Hardkutt følsomhet";

/* Oscilloscope Settings */
"Oscillo FX" = "Oscillo FX";
"Oscillo show labels" = "Oscillo vis etiketter";
"Oscillo labels font size" = "Oscillo etiketter skriftstørrelse";
"Oscillo show grid" = "Oscillo vis rutenett";
"Oscillo line width" = "Oscillo linjebredde";
"Reset all custom colors" = "Tilbakestill alle egendefinerte farger";
"Multi color | System 1" = "Multi farge | System 1";
"Multi color | System 2" = "Multi farge | System 2";
"Multi color | System 3" = "Multi farge | System 3";
"Multi color | System 4" = "Multi farge | System 4";
"Multi color | System 5" = "Multi farge | System 5";
"Multi color | System 6" = "Multi farge | System 6";
"Multi color | System 7" = "Multi farge | System 7";
"Multi color | System 8" = "Multi farge | System 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Egendefinert farge 01";
"Custom color 02" = "Egendefinert farge 02";
"Custom color 03" = "Egendefinert farge 03";
"Custom color 04" = "Egendefinert farge 04";
"Custom color 05" = "Egendefinert farge 05";
"Custom color 06" = "Egendefinert farge 06";
"Custom color 07" = "Egendefinert farge 07";
"Custom color 08" = "Egendefinert farge 08";
"Custom color 09" = "Egendefinert farge 09";
"Custom color 10" = "Egendefinert farge 10";
"Custom color 11" = "Egendefinert farge 11";
"Custom color 12" = "Egendefinert farge 12";
"Custom color 13" = "Egendefinert farge 13";
"Custom color 14" = "Egendefinert farge 14";
"Custom color 15" = "Egendefinert farge 15";
"Custom color 16" = "Egendefinert farge 16";
"Custom color 17" = "Egendefinert farge 17";
"Custom color 18" = "Egendefinert farge 18";
"Custom color 19" = "Egendefinert farge 19";
"Custom color 20" = "Egendefinert farge 20";
"Custom color 21" = "Egendefinert farge 21";
"Custom color 22" = "Egendefinert farge 22";
"Custom color 23" = "Egendefinert farge 23";
"Custom color 24" = "Egendefinert farge 24";
"Custom color 25" = "Egendefinert farge 25";
"Custom color 26" = "Egendefinert farge 26";
"Custom color 27" = "Egendefinert farge 27";
"Custom color 28" = "Egendefinert farge 28";
"Custom color 29" = "Egendefinert farge 29";
"Custom color 30" = "Egendefinert farge 30";
"Custom color 31" = "Egendefinert farge 31";
"Custom color 32" = "Egendefinert farge 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Hopper over sang hvis ingenting spilles i angitt varighet (0=av)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Standardlengde";
"Oversampling. Min=0, default: 10" = "Oversampling. Min=0, standard: 10";
"Min=off, default: 112" = "Min=av, standard: 112";
"Max=off, default: 164" = "Maks=av, standard: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=tving NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Tvinger IRQ-kapabilitet for alle NSF-er, ikke bare NSF2";
"APU unmute on reset" = "APU unmute ved tilbakestilling";
"APU phase reset" = "APU fasetilbakestilling";
"APU non linear mixing" = "APU ikke-lineær miksing";
"APU swap duty 1/2" = "APU bytt duty 1/2";
"APU Initialize sweep unmute" = "APU Initialiser sweep unmute";
"DMC enable $4011 writes" = "DMC aktiver $4011 skriving";
"DMC enable periodic noise" = "DMC aktiver periodisk støy";
"DMC unmute on reset" = "DMC unmute ved tilbakestilling";
"DMC anti clicking" = "DMC anti-klikking";
"DMC non linear mixer" = "DMC ikke-lineær mikser";
"DMC randomize noise on reset" = "DMC randomiser støy ved tilbakestilling";
"DMC mute triangle on pitch 0" = "DMC demp trekant ved pitch 0";
"prevents high frequency aliasing" = "forhindrer høyfrekvent aliasing";
"DMC rand. triangle" = "DMC tilf. trekant";
"randomize triangle on reset" = "randomiser trekant ved tilbakestilling";
"DMC reverse bits" = "DMC reverser bits";
"reverse bits of DPCM sample bytes" = "reverser bits av DPCM sample bytes";
"MMC5 non linear mixing" = "MMC5 ikke-lineær miksing";
"MMC5 Phase reset" = "MMC5 fasetilbakestilling";
"Reset phase counter after write $5003 and $5007" = "Tilbakestill faseteller etter skriving $5003 og $5007";
"FDS LP filter in Hz" = "FDS LP-filter i Hz";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Avskjæringsfrekvens (0Hz=av, 2000Hz=standard)";
"FDS reset \"phase\"" = "FDS tilbakestill \"fase\"";
"$4085 \"resets\" modular phase" = "$4085 \"tilbakestiller\" modulær fase";
"FDS write protect" = "FDS skrivebeskyttelse";
"write protect $8000-DFFF" = "skrivebeskyt $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 erstatt med OPLL";
"N163 Serial Multiplex mixing" = "N163 seriell Multiplex miksing";
"N163 Write Protect Phase" = "N163 skrivebeskyttelse fase";
"N163 Limit Wavelength" = "N163 begrens bølgelengde";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Kun for HC plugin";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Panoreringsverdi";
"Gain value" = "Forsterkningsverdi";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Deaktiver";
"Enter playlist name" = "Skriv inn spillelistenavn";
"Ask" = "Spør";
"Play All" = "Spill alle";
"Single" = "Enkel";
"Archive" = "Arkiv";
"On" = "På";
"Off" = "Av";
"Lim" = "Lim";

// ==================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ==================================

/* Playlist Menu Entries */
"Add a playlist" = "Legg til en spilleliste";
"Create a new playlist" = "Opprett en ny spilleliste";
"Now playing" = "Spiller nå";
"1 entry" = "1 oppføring";
"No entry" = "Ingen oppføring";
"Random picks" = "Tilfeldige valg";
"Generate a randomized playlist" = "Generer en randomisert spilleliste";
"Most played" = "Mest spilt";
"Favorites" = "Favoritter";

/* Playlist Actions */
"Add/Remove files..." = "Legg til/fjern filer...";
"More actions..." = "Flere handlinger...";
"Save as a new playlist" = "Lagre som ny spilleliste";

// ==================================
// MARK: - WELCOME PAGES
// ==================================

"Welcome to Modizer!\n" = "Velkommen til Modizer!\n";
"Level up your library" = "Oppgrader biblioteket ditt";
"Sound meets visuals." = "Lyd møter visuals.";
"Made with passion,\n offered for free." = "Laget med lidenskap,\n tilbudt gratis.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Din port til retro og tracker-musikk.\nGi enheten din kraft med legendariske spillmelodier, ikoniske tracker-moduler og tidløse chiptune-klassikere.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Bla og stream fra online kataloger for å fullføre dine egne samlinger.\nBygg, rediger og lytt til spillelister ubesværet.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Lås opp klassisk oscilloskop-utseende, spektrumstolper, pianoruller, tracker-visning og ProjectM/Milkdrop FX. La Modizer male hvert spor med bevegelse og farge.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Hvis du liker appen, er tips en flott måte å støtte dens pågående utvikling.\nTakk for at du hjelper med å holde Modizer i live og utvikler seg.";

"Skip" = "Hopp over";

// ==================================
// MARK: - TIPS / DONATIONS
// ==================================

/* Tips Screen */
"Support with a Tip" = "Støtt med et tips";
"Enjoy Modizer ?" = "Liker du Modizer?";
"Your support helps keep Modizer running and ad-free!" = "Din støtte hjelper med å holde Modizer i gang og reklamefri!";
"Already tipped so far" = "Allerede gitt tips så langt";
"Thank you for your support! 🙏" = "Takk for din støtte! 🙏";

/* Tip Tiers */
"Coffee" = "Kaffe";
"Coffee & Croissant" = "Kaffe og croissant";
"Dinner" = "Middag";
"Loading..." = "Laster...";

/* Tip Actions */
"Confirm Tip" = "Bekreft tips";
"Send Tip" = "Send tips";
"Send a %@ tip for %@?" = "Send et %@ tips for %@?";
"Tip" = "Tips";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Kan ikke laste produkter. Vennligst sjekk internettforbindelsen din.";

/* Thank You Alert */
"Thank You! 🙏" = "Takk! 🙏";
"Your support means everything! Thank you for helping keep Modizer running." = "Din støtte betyr alt! Takk for at du hjelper med å holde Modizer i gang.";

// ==================================
// MARK: - MAINTENANCE SCREEN
// ==================================

/* Maintenance Actions */
"Clean Database" = "Rens database";
"Clear 'Now Playing' queue" = "Tøm 'Spiller nå'-køen";
"Recreate Samples folder" = "Gjenopprett Samples-mappe";
"Reset settings to default" = "Tilbakestill innstillinger til standard";
"Remove current cover" = "Fjern gjeldende cover";
"Reset Ratings" = "Tilbakestill vurderinger";
"Reset Played Counters" = "Tilbakestill avspillingsteller";
"Reset Database" = "Tilbakestill database";
"Clear images cache" = "Tøm bildebuffer";

/* Maintenance Messages */
"Settings reseted" = "Innstillinger tilbakestilt";
"Ratings reseted" = "Vurderinger tilbakestilt";
"Played Counters reseted" = "Avspillingsteller tilbakestilt";
"Samples folder created" = "Samples-mappe opprettet";
"Cache cleaned" = "Buffer tømt";
"Database reseted" = "Database tilbakestilt";
"No cover to remove" = "Ingen cover å fjerne";
"Cover removed" = "Cover fjernet";
"Database cleaned" = "Database renset";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Er du sikker på at du vil rense databasen, det kan ta litt tid?";
"Clean" = "Rens";
"Cleaning DB" = "Renser database";
"Cancelling..." = "Avbryter...";

// ==================================
// MARK: - PLAYERMENU
// ==================================

"Close FX\n window" = "Lukk FX\n vindu";
"All FX off" = "Alle FX av";
"FX\n alpha" = "FX\n alpha";
"Show name\n temp." = "Vis navn\n midl.";
"Show name" = "Vis navn";
"Bundled\n presets" = "Medfølgende\n forhåndsinnstillinger";
"Custom\n presets" = "Egendefinerte\n forhåndsinnstillinger";
"Blend\n presets" = "Bland\n forhåndsinnstillinger";
"Clear\n all" = "Tøm\n alt";
"Select\n all" = "Velg\n alt";
"Favorites" = "Favoritter";
"Expand" = "Utvid";
"Select\n listed" = "Velg\n listede";
"Remove\n listed" = "Fjern\n listede";
"Selected" = "Valgt";
"Collapse" = "Kollaps";
"Labels" = "Etiketter";
"Grid" = "Rutenett";
"Voices\n labels" = "Stemme\n etiketter";
"Octaves\n labels" = "Oktav\n etiketter";
"Volume\n bars" = "Volum\n stolper";
"Fixed bar" = "Fast stolpe";
"BG\n opacity" = "BG\n ugjennomsiktighet";
"Bloom:\n %s" = "Bloom:\n %s";
"Thickness:\n %s" = "Tykkelse:\n %s";
"Font size\n %s" = "Skriftstørrelse\n %s";
"Font:\n %s" = "Skrifttype:\n %s";
"Info HUD:\n %s" = "Info HUD:\n %s";
"Select active %s presets" = "Velg aktive %s forhåndsinnstillinger";
"bundled" = "medfølgende";
"custom" = "egendefinert";
"Select\n custom\n presets" = "Velg\n egendefinerte\n forhåndsinnstillinger";
"Select\n bundled\n presets" = "Velg\n medfølgende\n forhåndsinnstillinger";
"Themes:\n %s" = "Temaer:\n %s";
